##  Intro
* Use to Store data in Dataframes
* Used to clean, manipulate your data
* Helps you work on different data sources like .csv, .txt, .xls, MySQL, NoSQL, Cloud Storages...

## Two main data structures in Pandas
* One dimensional called series
* Two dimensoinal called DataFrames

In [1]:
pip install pandas

Requirement already satisfied: pandas in /usr/local/Cellar/jupyterlab/2.2.0/libexec/lib/python3.8/site-packages (1.1.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/Cellar/jupyterlab/2.2.0/libexec/lib/python3.8/site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/Cellar/jupyterlab/2.2.0/libexec/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/Cellar/jupyterlab/2.2.0/libexec/lib/python3.8/site-packages (from pandas) (1.19.1)
Requirement already satisfied: six>=1.5 in /usr/local/Cellar/jupyterlab/2.2.0/libexec/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the '/usr/local/Cellar/jupyterlab/2.2.0/libexec/bin/python3.8 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
l = list(range(5,50,5))
pd.Series(l)

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
dtype: int64

In [4]:
pd.Series(list(range(5,50,5)))

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
dtype: int64

In [5]:
##
pd.Series(list(range(5,50,5)), name='First Series')

0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45
Name: First Series, dtype: int64

In [6]:
## Can create series with just one number
pd.Series(4)

0    4
dtype: int64

In [7]:
## Can be derived from dictionnaries. Keys are indexes here
my_dict = {'apples':10,'cucumbers':20,'bread':30, 'bacon':40,'water':2}

In [8]:
my_series=pd.Series(my_dict, name='groceries')

In [9]:
my_series.apples

10

In [10]:
## if values of your dictionary are collections will be stored as values of series
pd.Series({'a':[0,1,2,3,4,5],'b':[0,1,4,9,16,25],'c':[-1,-2,-3,-4,-5,-6]})

a          [0, 1, 2, 3, 4, 5]
b        [0, 1, 4, 9, 16, 25]
c    [-1, -2, -3, -4, -5, -6]
dtype: object

In [11]:
s=pd.Series({'apples':10,'cucumbers':3, 'bread':2, 'bacon':5, \
             'water':5, 'sunscreen':1, 'baby wipes':1, 'bug spray':2, \
             'blanket':1, 'beer':10, 'wine':1, 'bottle opener':2, \
             'knife':1, 'towel':2, 'trash bags':5, 'ice packs':2, \
             'camera':1, 'board games':2}, name='picnic')

## Attributes in Series

In [12]:
## to check data type
s.dtype

dtype('int64')

In [13]:
## to check for null values
s.hasnans

False

In [14]:
## to fetch index of our series
s.index

Index(['apples', 'cucumbers', 'bread', 'bacon', 'water', 'sunscreen',
       'baby wipes', 'bug spray', 'blanket', 'beer', 'wine', 'bottle opener',
       'knife', 'towel', 'trash bags', 'ice packs', 'camera', 'board games'],
      dtype='object')

In [15]:
## to fetch value of our series
s.values

array([10,  3,  2,  5,  5,  1,  1,  2,  1, 10,  1,  2,  1,  2,  5,  2,  1,
        2])

In [16]:
# to get the number of rows
s.size

18

In [17]:
# to get the name of our serie
s.name

'picnic'

## Indexing

In [18]:
## by default it's top 5
s.head(10)

apples        10
cucumbers      3
bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [19]:
## get random samples
s.sample(5)

trash bags        5
ice packs         2
beer             10
baby wipes        1
bottle opener     2
Name: picnic, dtype: int64

In [20]:
##
s.tail(10)

blanket           1
beer             10
wine              1
bottle opener     2
knife             1
towel             2
trash bags        5
ice packs         2
camera            1
board games       2
Name: picnic, dtype: int64

In [21]:
## to fetch value based on index
s.wine

1

In [22]:
## to fecth the values of knife and towel
s[['towel', 'knife']]

towel    2
knife    1
Name: picnic, dtype: int64

In [23]:
s.index

Index(['apples', 'cucumbers', 'bread', 'bacon', 'water', 'sunscreen',
       'baby wipes', 'bug spray', 'blanket', 'beer', 'wine', 'bottle opener',
       'knife', 'towel', 'trash bags', 'ice packs', 'camera', 'board games'],
      dtype='object')

In [24]:
## to fect a range of values
s['bread':'beer']

bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [25]:
## Alternative solution
s.loc['bread':'beer']

bread          2
bacon          5
water          5
sunscreen      1
baby wipes     1
bug spray      2
blanket        1
beer          10
Name: picnic, dtype: int64

In [26]:
## to reseach with the index number
s.iloc[1]

3

In [27]:
## to research a range by the index number
s.iloc[1:5]

cucumbers    3
bread        2
bacon        5
water        5
Name: picnic, dtype: int64

## DataFrames

In [28]:
pd.DataFrame(l)

    0
0   5
1  10
2  15
3  20
4  25
5  30
6  35
7  40
8  45

In [29]:
pd.DataFrame(list(range(5,50,5)), columns=['col1'])

   col1
0     5
1    10
2    15
3    20
4    25
5    30
6    35
7    40
8    45

In [30]:
## Create a DataFrame from list of lists
my_list = [[i for i in range (j,j+5)] for j in range(10)]

In [31]:
pd.DataFrame(my_list, columns=['col1','col2','col3','col4','col5'])

   col1  col2  col3  col4  col5
0     0     1     2     3     4
1     1     2     3     4     5
2     2     3     4     5     6
3     3     4     5     6     7
4     4     5     6     7     8
5     5     6     7     8     9
6     6     7     8     9    10
7     7     8     9    10    11
8     8     9    10    11    12
9     9    10    11    12    13

In [32]:
## DataFrame from dictionnary
my_dict = {'apples':[10,20],'cucumbers':[20,30],'bread':[30,40], 'bacon':[40,50],'water':[2,3]}

In [33]:
pd.DataFrame(my_dict)

   apples  cucumbers  bread  bacon  water
0      10         20     30     40      2
1      20         30     40     50      3

In [34]:
pd.DataFrame(my_dict).T

            0   1
apples     10  20
cucumbers  20  30
bread      30  40
bacon      40  50
water       2   3

In [35]:
pd.DataFrame(my_dict, columns=['col1','col2']).T

Empty DataFrame
Columns: []
Index: [col1, col2]

In [36]:
colnames = ['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']
house_dict = {'Baker House': [7420, 'BrkSide', 1939, 5, 118000],
              'Beazley House': [14115, 'Mitchel', 1993, 5, 143000],
              'Dominguez House': [14260, 'NoRidge', 2000, 8, 250000],
              'Hamilton House': [6120, 'OldTown', 1931, 7, 129900],
              'James House': [11250, 'CollgCr', 2001, 7, 223500],
              'Martinez House': [9600, 'Veenker', 1976, 6, 181500],
              'Roberts House': [9550, 'Crawfor', 1915, 7, 140000],
              'Smith House': [8450, 'CollgCr', 2003, 7, 208500],
              'Snyder House': [10084, 'Somerst', 2004, 8, 307000],
              'Zuckerman House': [10382, 'NWAmes', 1973, 7, 200000]}

In [37]:
pd.DataFrame(house_dict)

,Baker House,Beazley House,Dominguez House,Hamilton House,James House,Martinez House,Roberts House,Smith House,Snyder House,Zuckerman House
0,7420,14115,14260,6120,11250,9600,9550,8450,10084,10382
1,BrkSide,Mitchel,NoRidge,OldTown,CollgCr,Veenker,Crawfor,CollgCr,Somerst,NWAmes
2,1939,1993,2000,1931,2001,1976,1915,2003,2004,1973
3,5,5,8,7,7,6,7,7,8,7
4,118000,143000,250000,129900,223500,181500,140000,208500,307000,200000

In [38]:
pd.DataFrame(house_dict).T

                     0        1     2  3       4
Baker House       7420  BrkSide  1939  5  118000
Beazley House    14115  Mitchel  1993  5  143000
Dominguez House  14260  NoRidge  2000  8  250000
Hamilton House    6120  OldTown  1931  7  129900
James House      11250  CollgCr  2001  7  223500
Martinez House    9600  Veenker  1976  6  181500
Roberts House     9550  Crawfor  1915  7  140000
Smith House       8450  CollgCr  2003  7  208500
Snyder House     10084  Somerst  2004  8  307000
Zuckerman House  10382   NWAmes  1973  7  200000

In [39]:
## In order to rename the columns
pd.DataFrame(house_dict,index=['LotSize','Neighborhood','YearBuilt','Quality','SalePrice']).T

                LotSize Neighborhood YearBuilt Quality SalePrice
Baker House        7420      BrkSide      1939       5    118000
Beazley House     14115      Mitchel      1993       5    143000
Dominguez House   14260      NoRidge      2000       8    250000
Hamilton House     6120      OldTown      1931       7    129900
James House       11250      CollgCr      2001       7    223500
Martinez House     9600      Veenker      1976       6    181500
Roberts House      9550      Crawfor      1915       7    140000
Smith House        8450      CollgCr      2003       7    208500
Snyder House      10084      Somerst      2004       8    307000
Zuckerman House   10382       NWAmes      1973       7    200000

In [40]:
## Alternative sol
df=pd.DataFrame.from_dict(house_dict, orient='index', columns=colnames)

In [41]:
df

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

## Attributes

In [42]:
# to check data types
df.dtypes

LotSize          int64
Neighborhood    object
YearBuilt        int64
Quality          int64
SalePrice        int64
dtype: object

In [43]:
# to fect index
df.index

Index(['Baker House', 'Beazley House', 'Dominguez House', 'Hamilton House',
       'James House', 'Martinez House', 'Roberts House', 'Smith House',
       'Snyder House', 'Zuckerman House'],
      dtype='object')

In [44]:
# to check values
df.values

array([[7420, 'BrkSide', 1939, 5, 118000],
       [14115, 'Mitchel', 1993, 5, 143000],
       [14260, 'NoRidge', 2000, 8, 250000],
       [6120, 'OldTown', 1931, 7, 129900],
       [11250, 'CollgCr', 2001, 7, 223500],
       [9600, 'Veenker', 1976, 6, 181500],
       [9550, 'Crawfor', 1915, 7, 140000],
       [8450, 'CollgCr', 2003, 7, 208500],
       [10084, 'Somerst', 2004, 8, 307000],
       [10382, 'NWAmes', 1973, 7, 200000]], dtype=object)

In [45]:
# to check columns
df.columns

Index(['LotSize', 'Neighborhood', 'YearBuilt', 'Quality', 'SalePrice'], dtype='object')

In [46]:
df.shape

(10, 5)

In [47]:
df.size

50

## Indexing

In [48]:
df.head(10)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [49]:
df.tail()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Martinez House      9600      Veenker       1976        6     181500
Roberts House       9550      Crawfor       1915        7     140000
Smith House         8450      CollgCr       2003        7     208500
Snyder House       10084      Somerst       2004        8     307000
Zuckerman House    10382       NWAmes       1973        7     200000

In [50]:
df.sample(3)

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Hamilton House      6120      OldTown       1931        7     129900
Zuckerman House    10382       NWAmes       1973        7     200000
Roberts House       9550      Crawfor       1915        7     140000

In [51]:
# to fect one column
df.LotSize

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [52]:
df['LotSize']

Baker House         7420
Beazley House      14115
Dominguez House    14260
Hamilton House      6120
James House        11250
Martinez House      9600
Roberts House       9550
Smith House         8450
Snyder House       10084
Zuckerman House    10382
Name: LotSize, dtype: int64

In [53]:
# to fetch several columns
df[['LotSize','YearBuilt']]

                 LotSize  YearBuilt
Baker House         7420       1939
Beazley House      14115       1993
Dominguez House    14260       2000
Hamilton House      6120       1931
James House        11250       2001
Martinez House      9600       1976
Roberts House       9550       1915
Smith House         8450       2003
Snyder House       10084       2004
Zuckerman House    10382       1973

In [54]:
# to fecth one row
df.loc['Roberts House']

LotSize            9550
Neighborhood    Crawfor
YearBuilt          1915
Quality               7
SalePrice        140000
Name: Roberts House, dtype: object

In [55]:
# to fecth several rows
df.loc[['Roberts House','Martinez House']]

                LotSize Neighborhood  YearBuilt  Quality  SalePrice
Roberts House      9550      Crawfor       1915        7     140000
Martinez House     9600      Veenker       1976        6     181500

In [56]:
## to fetch specific raws and columns
df.loc[['Roberts House','Martinez House'],['Quality','SalePrice']]

                Quality  SalePrice
Roberts House         7     140000
Martinez House        6     181500

In [57]:
df.iloc[0]

LotSize            7420
Neighborhood    BrkSide
YearBuilt          1939
Quality               5
SalePrice        118000
Name: Baker House, dtype: object

In [58]:
df.iloc[[0,7],[0,-1]]

             LotSize  SalePrice
Baker House     7420     118000
Smith House     8450     208500

In [59]:
## rows ranging from 1 to 7 and columns from 1 to 3
df.iloc[1:4,1:3]

                Neighborhood  YearBuilt
Beazley House        Mitchel       1993
Dominguez House      NoRidge       2000
Hamilton House       OldTown       1931

## Applying some mathematical functions

In [60]:
df.head()

                 LotSize Neighborhood  YearBuilt  Quality  SalePrice
Baker House         7420      BrkSide       1939        5     118000
Beazley House      14115      Mitchel       1993        5     143000
Dominguez House    14260      NoRidge       2000        8     250000
Hamilton House      6120      OldTown       1931        7     129900
James House        11250      CollgCr       2001        7     223500

In [61]:
## Total price of all house sold
df['SalePrice'].sum()

1901400

In [62]:
df['LotSize'].mean()

10123.1

In [63]:
df['YearBuilt'].max()

2004

In [64]:
df['YearBuilt'].min()

1915

## Import Export

In [66]:
import os
os.chdir(r'/Users/Jeff/Downloads/vehicles')

In [67]:
os.getcwd()

'/Users/Jeff/Downloads/vehicles'

In [68]:
os.listdir()

['.DS_Store',
 'vehicles_tab.txt',
 'vehicles_pipe.txt',
 'vehicles.json',
 'vehicles.xlsx',
 'vehicles_messy.csv',
 'vehicles.csv']

In [69]:
# Import comma-separated variable file
pd.read_csv('vehicles.csv')

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
35947,smart,fortwo coupe,2013,1.0,3.0,Auto(AM5),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,38,36,244.000000,1100
35948,smart,fortwo coupe,2014,1.0,3.0,Auto(AM5),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,38,36,243.000000,1100
35949,smart,fortwo coupe,2015,1.0,3.0,Auto(AM5),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,38,36,244.000000,1100
35950,smart,fortwo coupe,2016,0.9,3.0,Auto(AM6),Rear-Wheel Drive,Two Seaters,Premium,9.155833,34,39,36,246.000000,1100
35951,smart,fortwo coupe,2016,0.9,3.0,Manual 5-spd,Rear-Wheel Drive,Two Seaters,Premium,9.417429,32,39,35,255.000000,1150

In [70]:
# Import tab-delimited file
data = pd.read_csv('vehicles_tab.txt', sep='\t')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [71]:
# Import pipe-delimited file
data = pd.read_csv('vehicles_pipe.txt', sep='|')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [72]:
pip install xlrd

Requirement already satisfied: xlrd in /usr/local/Cellar/jupyterlab/2.2.0/libexec/lib/python3.8/site-packages (1.2.0)
WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the '/usr/local/Cellar/jupyterlab/2.2.0/libexec/bin/python3.8 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [73]:
# Import pipe-delimited file
data = pd.read_csv('vehicles_pipe.txt', sep='|')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6.0,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6.0,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6.0,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [74]:
data = pd.read_excel('vehicles.xlsx')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

In [75]:
data=pd.read_json('vehicles.json', orient='records')
data.head()

,Make,Model,Year,Engine Displacement,Cylinders,Transmission,Drivetrain,Vehicle Class,Fuel Type,Fuel Barrels/Year,City MPG,Highway MPG,Combined MPG,CO2 Emission Grams/Mile,Fuel Cost/Year
0,AM General,DJ Po Vehicle 2WD,1984,2.5,4,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,19.388824,18,17,17,522.764706,1950
1,AM General,FJ8c Post Office,1984,4.2,6,Automatic 3-spd,2-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
2,AM General,Post Office DJ5 2WD,1985,2.5,4,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,20.600625,16,17,16,555.437500,2100
3,AM General,Post Office DJ8 2WD,1985,4.2,6,Automatic 3-spd,Rear-Wheel Drive,Special Purpose Vehicle 2WD,Regular,25.354615,13,13,13,683.615385,2550
4,ASC Incorporated,GNX,1987,3.8,6,Automatic 4-spd,Rear-Wheel Drive,Midsize Cars,Premium,20.600625,14,21,16,555.437500,2550

## Export

In [76]:
# Export comma-separated variable file
data.to_csv('vehicles_new.csv', index=False)

# Export tab-delimited file
data.to_csv('vehicles_tab_new.txt', sep='\t', index=False)

# Export pipe-delimited file
data.to_csv('vehicles_pipe_new.txt', sep='|', index=False)

In [78]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.5-py2.py3-none-any.whl (242 kB)
     || 242 kB 1.8 MB/s eta 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.0.1.tar.gz (8.4 kB)
Collecting jdcal
  Downloading jdcal-1.4.1-py2.py3-none-any.whl (9.5 kB)
Building wheels for collected packages: et-xmlfile
  Building wheel for et-xmlfile (setup.py) ... done
  Created wheel for et-xmlfile: filename=et_xmlfile-1.0.1-py3-none-any.whl size=8915 sha256=e1b35ff20aa595c6967fd3057a9a8dec6183c2653b1027f64daf1f9a443dfb07
  Stored in directory: /Users/Jeff/Library/Caches/pip/wheels/6e/df/38/abda47b884e3e25f9f9b6430e5ce44c47670758a50c0c51759
Successfully built et-xmlfile
Installing collected packages: et-xmlfile, jdcal, openpyxl
Successfully installed et-xmlfile-1.0.1 jdcal-1.4.1 openpyxl-3.0.5
WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the '/usr/local/Cellar/jupyterlab/2.2.0/libexec/bin/python3.8 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [80]:
data.to_excel('vehicles_new.xlsx', index=False)

In [81]:
data.to_json('vehicles_new.json', orient='records')

In [82]:
sorted(os.listdir())

['.DS_Store',
 'vehicles.csv',
 'vehicles.json',
 'vehicles.xlsx',
 'vehicles_messy.csv',
 'vehicles_new.csv',
 'vehicles_new.json',
 'vehicles_new.xlsx',
 'vehicles_pipe.txt',
 'vehicles_pipe_new.txt',
 'vehicles_tab.txt',
 'vehicles_tab_new.txt']

## MySQL

In [83]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-0.10.0-py2.py3-none-any.whl (47 kB)
     || 47 kB 1.0 MB/s eta 0:00:01
Installing collected packages: pymysql
Successfully installed pymysql-0.10.0
WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the '/usr/local/Cellar/jupyterlab/2.2.0/libexec/bin/python3.8 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [87]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-1.3.19-cp38-cp38-macosx_10_14_x86_64.whl (1.2 MB)
     || 1.2 MB 3.7 MB/s eta 0:00:01
Installing collected packages: sqlalchemy
Successfully installed sqlalchemy-1.3.19
WARNING: You are using pip version 20.1.1; however, version 20.2.2 is available.
You should consider upgrading via the '/usr/local/Cellar/jupyterlab/2.2.0/libexec/bin/python3.8 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [88]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
from getpass import getpass
from sqlalchemy import inspect

In [89]:
username='root'
password=getpass()

In [90]:
engine=create_engine(f'mysql+pymysql://{username}:{password}@localhost/finance1')

In [92]:
inspector=inspect(engine)
inspector.get_table_names()

[]

## Get data in python

In [93]:
os.getcwd()

'/Users/Jeff/Downloads/vehicles'

In [94]:
os.chdir('/Users/Jeff/Downloads/finance')

In [95]:
os.getcwd()

'/Users/Jeff/Downloads/finance'

In [96]:
os.listdir()

['berka.pdf',
 'account.asc',
 'card.asc',
 'order.asc',
 'disp.asc',
 'loan.asc',
 'client.asc',
 'district.asc',
 'trans.asc']

In [99]:
df=pd.read_csv('order.asc', sep=';')

In [102]:
inspector=inspect(engine)
inspector.get_table_names()

['order']

In [100]:
df.to_sql('order',engine, if_exists='replace', index=False)

In [105]:
for i in os.listdir():
    if i.endswith('asc'):
        df=pd.read_csv(i, sep=';')
        df.to_sql(i[:-4], engine, if_exists='replace', index =False)

/usr/local/Cellar/jupyterlab/2.2.0/libexec/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3071: DtypeWarning: Columns (8) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [106]:
inspector=inspect(engine)
inspector.get_table_names()

['account', 'card', 'client', 'disp', 'district', 'loan', 'order', 'trans']